results/nicola/mongo/workloade/rc200000_oc50000_fc10_fl100_raftrue/run_rep2_2025-05-21_14-43-11.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
/opt/java/openjdk/bin/java -cp /opt/YCSB_PROJECT_ROOT/mongodb/conf:/opt/YCSB_PROJECT_ROOT/mongodb/target/mongodb-binding-0.17.0.jar:/root/.m2/repository/org/mongodb/mongo-java-driver/3.8.0/mongo-java-driver-3.8.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/opt/YCSB_PROJECT_ROOT/core/target/core-0.17.0.jar:/root/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/root/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloade -p recordcount=200000 -p operationcount=50000 -p fieldcount=10 -p fieldlength=100 -p readallfields=true -p mongodb.url=mongodb://mongo-mongos:27017/ycsb?w=1 -t
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloade -p recordcount=200000 -p operationcount=50000 -p fieldcount=10 -p fieldlength=100 -p readallfields=true -p mongodb.url=mongodb://mongo-mongos:27017/ycsb?w=1 -t
YCSB Client 0.17.0

Loading workload...
Starting test.
2025-05-21 12:44:26:825 0 sec: 0 operations; est completion in 0 second 
May 21, 2025 12:44:26 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[mongo-mongos:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://mongo-mongos:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
May 21, 2025 12:44:26 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
May 21, 2025 12:44:26 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1}] to mongo-mongos:27017
May 21, 2025 12:44:26 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=mongo-mongos:27017, type=SHARD_ROUTER, state=CONNECTED, ok=true, version=ServerVersion{versionList=[7, 0, 20]}, minWireVersion=0, maxWireVersion=21, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=1230700}
May 21, 2025 12:44:26 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2}] to mongo-mongos:27017
2025-05-21 12:44:36:803 10 sec: 18678 operations; 1867.8 current ops/sec; est completion in 17 seconds [INSERT: Count=951, Max=6411, Min=152, Avg=353.64, 90=525, 99=983, 99.9=2113, 99.99=6411] [SCAN: Count=17734, Max=35999, Min=154, Avg=531.99, 90=766, 99=1486, 99.9=2439, 99.99=4567] 
2025-05-21 12:44:46:804 20 sec: 39362 operations; 2068.4 current ops/sec; est completion in 6 second [INSERT: Count=1077, Max=1625, Min=144, Avg=279.11, 90=350, 99=705, 99.9=1193, 99.99=1625] [SCAN: Count=19601, Max=5291, Min=148, Avg=492.2, 90=698, 99=1250, 99.9=2030, 99.99=3109] 
May 21, 2025 12:44:51 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2}] to mongo-mongos:27017 because the pool has been closed.
2025-05-21 12:44:51:999 25 sec: 50000 operations; 2047.34 current ops/sec; [CLEANUP: Count=1, Max=1496, Min=1496, Avg=1496, 90=1496, 99=1496, 99.9=1496, 99.99=1496] [INSERT: Count=536, Max=1424, Min=153, Avg=271.93, 90=325, 99=870, 99.9=1167, 99.99=1424] [SCAN: Count=10101, Max=3545, Min=142, Avg=497.28, 90=694, 99=1549, 99.9=2351, 99.99=2933] 
[OVERALL], RunTime(ms), 25196
[OVERALL], Throughput(ops/sec), 1984.4419749166534
[TOTAL_GCS_G1_Young_Generation], Count, 126
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 66
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.26194634068899825
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 126
[TOTAL_GC_TIME], Time(ms), 66
[TOTAL_GC_TIME_%], Time(%), 0.26194634068899825
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1496.0
[CLEANUP], MinLatency(us), 1496
[CLEANUP], MaxLatency(us), 1496
[CLEANUP], 95thPercentileLatency(us), 1496
[CLEANUP], 99thPercentileLatency(us), 1496
[INSERT], Operations, 2564
[INSERT], AverageLatency(us), 305.2519500780031
[INSERT], MinLatency(us), 144
[INSERT], MaxLatency(us), 6411
[INSERT], 95thPercentileLatency(us), 544
[INSERT], 99thPercentileLatency(us), 878
[INSERT], Return=OK, 2564
[SCAN], Operations, 47436
[SCAN], AverageLatency(us), 508.1537861539759
[SCAN], MinLatency(us), 142
[SCAN], MaxLatency(us), 35999
[SCAN], 95thPercentileLatency(us), 863
[SCAN], 99thPercentileLatency(us), 1401
[SCAN], Return=OK, 47436